src/exps/fio_benchmarks/paperexps/CMR-4G.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=20495: Fri Sep 28 21:14:11 2018
  write: IOPS=340, BW=1362KiB/s (1394kB/s)(239MiB/180001msec)
    clat (usec): min=164, max=74847, avg=2928.64, stdev=1999.22
     lat (usec): min=164, max=74847, avg=2929.51, stdev=1999.22
    clat percentiles (usec):
     |  1.00th=[  269],  5.00th=[ 1713], 10.00th=[ 2180], 20.00th=[ 2474],
     | 30.00th=[ 2540], 40.00th=[ 2606], 50.00th=[ 2671], 60.00th=[ 2769],
     | 70.00th=[ 2900], 80.00th=[ 3064], 90.00th=[ 3359], 95.00th=[ 3982],
     | 99.00th=[12518], 99.50th=[12911], 99.90th=[24249], 99.95th=[33817],
     | 99.99th=[34866]
   bw (  KiB/s): min=  735, max= 1845, per=78.95%, avg=1074.50, stdev=73.38, samples=359
   iops        : min=  183, max=  461, avg=268.25, stdev=18.35, samples=359
  lat (usec)   : 250=0.65%, 500=1.89%, 750=0.02%, 1000=0.03%
  lat (msec)   : 2=5.33%, 4=87.20%, 10=3.01%, 20=1.53%, 50=0.33%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.36%, sys=1.10%, ctx=61285, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,61276,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=20754: Fri Sep 28 21:14:11 2018
  write: IOPS=342, BW=1371KiB/s (1404kB/s)(402MiB/300001msec)
    clat (usec): min=165, max=132389, avg=2909.09, stdev=1892.28
     lat (usec): min=166, max=132389, avg=2909.93, stdev=1892.28
    clat percentiles (usec):
     |  1.00th=[  269],  5.00th=[ 1713], 10.00th=[ 2212], 20.00th=[ 2474],
     | 30.00th=[ 2573], 40.00th=[ 2606], 50.00th=[ 2671], 60.00th=[ 2769],
     | 70.00th=[ 2900], 80.00th=[ 3064], 90.00th=[ 3359], 95.00th=[ 3916],
     | 99.00th=[12518], 99.50th=[12911], 99.90th=[24249], 99.95th=[33817],
     | 99.99th=[34341]
   bw (  KiB/s): min= 1112, max= 1784, per=100.00%, avg=1370.81, stdev=69.80, samples=599
   iops        : min=  278, max=  446, avg=342.68, stdev=17.45, samples=599
  lat (usec)   : 250=0.64%, 500=1.89%, 750=0.01%, 1000=0.02%
  lat (msec)   : 2=5.24%, 4=87.53%, 10=2.94%, 20=1.50%, 50=0.23%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.35%, sys=1.19%, ctx=102824, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,102813,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1362KiB/s (1394kB/s), 1362KiB/s-1362KiB/s (1394kB/s-1394kB/s), io=239MiB (251MB), run=180001-180001msec

Run status group 1 (all jobs):
  WRITE: bw=1371KiB/s (1404kB/s), 1371KiB/s-1371KiB/s (1404kB/s-1404kB/s), io=402MiB (421MB), run=300001-300001msec

Disk stats (read/write):
  sdc: ios=44/164037, merge=0/0, ticks=66/469591, in_queue=469420, util=97.78%