src/exps/fio_benchmarks/paperexps/CMR-4T.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=27698: Fri Sep 28 22:34:19 2018
  write: IOPS=145, BW=581KiB/s (595kB/s)(102MiB/180003msec)
    clat (usec): min=159, max=89305, avg=6871.19, stdev=4512.36
     lat (usec): min=160, max=89305, avg=6872.03, stdev=4512.36
    clat percentiles (usec):
     |  1.00th=[ 2606],  5.00th=[ 3458], 10.00th=[ 4015], 20.00th=[ 4752],
     | 30.00th=[ 5211], 40.00th=[ 5604], 50.00th=[ 5997], 60.00th=[ 6456],
     | 70.00th=[ 7111], 80.00th=[ 7963], 90.00th=[ 9765], 95.00th=[14222],
     | 99.00th=[19006], 99.50th=[21890], 99.90th=[76022], 99.95th=[78119],
     | 99.99th=[81265]
   bw (  KiB/s): min=  334, max= 1032, per=83.11%, avg=482.88, stdev=54.75, samples=359
   iops        : min=   83, max=  258, avg=120.38, stdev=13.70, samples=359
  lat (usec)   : 250=0.13%, 500=0.17%, 1000=0.01%
  lat (msec)   : 2=0.09%, 4=9.53%, 10=80.65%, 20=8.61%, 50=0.62%
  lat (msec)   : 100=0.20%
  cpu          : usr=0.17%, sys=0.58%, ctx=26162, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,26156,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=27959: Fri Sep 28 22:34:19 2018
  write: IOPS=144, BW=576KiB/s (590kB/s)(169MiB/300002msec)
    clat (usec): min=176, max=509947, avg=6930.07, stdev=5042.35
     lat (usec): min=176, max=509949, avg=6930.88, stdev=5042.35
    clat percentiles (usec):
     |  1.00th=[ 2671],  5.00th=[ 3490], 10.00th=[ 4047], 20.00th=[ 4752],
     | 30.00th=[ 5211], 40.00th=[ 5669], 50.00th=[ 6063], 60.00th=[ 6521],
     | 70.00th=[ 7111], 80.00th=[ 7963], 90.00th=[10028], 95.00th=[14746],
     | 99.00th=[19530], 99.50th=[22152], 99.90th=[70779], 99.95th=[78119],
     | 99.99th=[85459]
   bw (  KiB/s): min=  408, max= 1264, per=100.00%, avg=577.38, stdev=61.13, samples=599
   iops        : min=  102, max=  316, avg=144.34, stdev=15.28, samples=599
  lat (usec)   : 250=0.08%, 500=0.12%
  lat (msec)   : 2=0.06%, 4=9.34%, 10=80.43%, 20=9.06%, 50=0.74%
  lat (msec)   : 100=0.16%, 750=0.01%
  cpu          : usr=0.18%, sys=0.50%, ctx=43234, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,43230,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=581KiB/s (595kB/s), 581KiB/s-581KiB/s (595kB/s-595kB/s), io=102MiB (107MB), run=180003-180003msec

Run status group 1 (all jobs):
  WRITE: bw=576KiB/s (590kB/s), 576KiB/s-576KiB/s (590kB/s-590kB/s), io=169MiB (177MB), run=300002-300002msec

Disk stats (read/write):
  sdc: ios=87/69354, merge=0/0, ticks=283/475531, in_queue=475697, util=99.07%