src/exps/fio_benchmarks/paperexps/CMR-512G.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=25642: Fri Sep 28 22:10:16 2018
  write: IOPS=212, BW=849KiB/s (869kB/s)(149MiB/180002msec)
    clat (usec): min=184, max=77114, avg=4704.50, stdev=2646.72
     lat (usec): min=185, max=77114, avg=4705.36, stdev=2646.72
    clat percentiles (usec):
     |  1.00th=[ 2409],  5.00th=[ 2900], 10.00th=[ 3130], 20.00th=[ 3458],
     | 30.00th=[ 3752], 40.00th=[ 4015], 50.00th=[ 4293], 60.00th=[ 4621],
     | 70.00th=[ 4883], 80.00th=[ 5211], 90.00th=[ 5669], 95.00th=[ 6259],
     | 99.00th=[15401], 99.50th=[16450], 99.90th=[35914], 99.95th=[36439],
     | 99.99th=[45876]
   bw (  KiB/s): min=  523, max= 1333, per=79.41%, avg=673.38, stdev=52.09, samples=359
   iops        : min=  130, max=  333, avg=167.97, stdev=13.04, samples=359
  lat (usec)   : 250=0.10%, 500=0.13%, 1000=0.01%
  lat (msec)   : 2=0.14%, 4=39.01%, 10=57.06%, 20=3.23%, 50=0.31%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.23%, sys=0.71%, ctx=38188, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,38186,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=25886: Fri Sep 28 22:10:16 2018
  write: IOPS=212, BW=848KiB/s (868kB/s)(248MiB/300001msec)
    clat (usec): min=193, max=262778, avg=4707.34, stdev=2809.50
     lat (usec): min=193, max=262780, avg=4708.20, stdev=2809.50
    clat percentiles (usec):
     |  1.00th=[ 2474],  5.00th=[ 2900], 10.00th=[ 3163], 20.00th=[ 3458],
     | 30.00th=[ 3752], 40.00th=[ 4047], 50.00th=[ 4293], 60.00th=[ 4621],
     | 70.00th=[ 4948], 80.00th=[ 5211], 90.00th=[ 5735], 95.00th=[ 6325],
     | 99.00th=[14877], 99.50th=[16319], 99.90th=[35914], 99.95th=[36963],
     | 99.99th=[67634]
   bw (  KiB/s): min=  712, max= 1120, per=100.00%, avg=848.11, stdev=46.63, samples=599
   iops        : min=  178, max=  280, avg=212.02, stdev=11.66, samples=599
  lat (usec)   : 250=0.07%, 500=0.10%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.11%, 4=38.46%, 10=57.93%, 20=2.99%, 50=0.32%
  lat (msec)   : 100=0.01%, 500=0.01%
  cpu          : usr=0.23%, sys=0.79%, ctx=63613, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,63607,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=849KiB/s (869kB/s), 849KiB/s-849KiB/s (869kB/s-869kB/s), io=149MiB (156MB), run=180002-180002msec

Run status group 1 (all jobs):
  WRITE: bw=848KiB/s (868kB/s), 848KiB/s-848KiB/s (868kB/s-868kB/s), io=248MiB (261MB), run=300001-300001msec

Disk stats (read/write):
  sdc: ios=125/101757, merge=0/0, ticks=40/473459, in_queue=473357, util=98.60%