src/exps/fio_benchmarks/paperexps/CMR-512M.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=18337: Fri Sep 28 20:50:09 2018
  write: IOPS=391, BW=1565KiB/s (1602kB/s)(275MiB/180001msec)
    clat (usec): min=149, max=74579, avg=2547.82, stdev=2291.42
     lat (usec): min=150, max=74580, avg=2548.66, stdev=2291.41
    clat percentiles (usec):
     |  1.00th=[  208],  5.00th=[  245], 10.00th=[  285], 20.00th=[ 1582],
     | 30.00th=[ 2040], 40.00th=[ 2442], 50.00th=[ 2540], 60.00th=[ 2606],
     | 70.00th=[ 2704], 80.00th=[ 2900], 90.00th=[ 3621], 95.00th=[ 4817],
     | 99.00th=[12125], 99.50th=[13173], 99.90th=[23987], 99.95th=[33162],
     | 99.99th=[34341]
   bw (  KiB/s): min= 1042, max= 2124, per=79.53%, avg=1243.83, stdev=82.74, samples=359
   iops        : min=  260, max=  531, avg=310.57, stdev=20.69, samples=359
  lat (usec)   : 250=5.66%, 500=11.59%, 750=0.05%, 1000=0.10%
  lat (msec)   : 2=11.79%, 4=62.61%, 10=5.88%, 20=2.01%, 50=0.30%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.39%, sys=1.23%, ctx=70416, majf=0, minf=30
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,70411,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=18591: Fri Sep 28 20:50:09 2018
  write: IOPS=401, BW=1607KiB/s (1646kB/s)(471MiB/300002msec)
    clat (usec): min=153, max=348958, avg=2479.99, stdev=2450.79
     lat (usec): min=154, max=348959, avg=2480.81, stdev=2450.78
    clat percentiles (usec):
     |  1.00th=[  208],  5.00th=[  243], 10.00th=[  281], 20.00th=[ 1532],
     | 30.00th=[ 1975], 40.00th=[ 2376], 50.00th=[ 2540], 60.00th=[ 2606],
     | 70.00th=[ 2704], 80.00th=[ 2835], 90.00th=[ 3490], 95.00th=[ 4621],
     | 99.00th=[12125], 99.50th=[13173], 99.90th=[23987], 99.95th=[32900],
     | 99.99th=[34866]
   bw (  KiB/s): min=  920, max= 2176, per=100.00%, avg=1607.45, stdev=104.11, samples=600
   iops        : min=  230, max=  544, avg=401.83, stdev=26.03, samples=600
  lat (usec)   : 250=5.93%, 500=11.85%, 750=0.08%, 1000=0.11%
  lat (msec)   : 2=12.41%, 4=62.12%, 10=5.56%, 20=1.61%, 50=0.32%
  lat (msec)   : 100=0.01%, 500=0.01%
  cpu          : usr=0.40%, sys=1.24%, ctx=120559, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,120551,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1565KiB/s (1602kB/s), 1565KiB/s-1565KiB/s (1602kB/s-1602kB/s), io=275MiB (288MB), run=180001-180001msec

Run status group 1 (all jobs):
  WRITE: bw=1607KiB/s (1646kB/s), 1607KiB/s-1607KiB/s (1646kB/s-1646kB/s), io=471MiB (494MB), run=300002-300002msec

Disk stats (read/write):
  sdc: ios=125/190901, merge=0/0, ticks=108/468914, in_queue=468779, util=97.65%